<template>
  <div id="about" class="about">
    <v-phones />
    <div class="layout">
      <h2 class="about-title">
        Благотворительный фонд<br>
        “Преподобного Геннадия Костромского<br>
        и Любимоградского”
      </h2>
      <div class="about-inside">
        <p>
          Основным направлением Благотворительного фонда поддержки социальных инициатив «Преподобного Геннадия Костромского и Любимоградского» является православная помощь наркозависимым.
        </p>
        <p>
          К сожалению, вопрос лечения наркомании в Костроме является весьма актуальным. На территории Костромской области действует несколько реабилитационных центров и организаций по оказанию помощи наркозависимым. Часть из них является мошенническими либо сектантскими структурами. Поэтому и было принято решение о создании реабилитационного центра для наркоманов, действующего с поддержкой Костромской епархии и государственных структур.
        </p>
        <p>
          В 2015 году было открыто одно из структурных подразделений фонда — Реабилитационный центр «Сумароково» (внесен в ЕГРЮЛ c 26.08.2015), который вошел в сеть православных реабилитационных центров для наркоманов. Сеть подобных центров создана по всей России, руководит этим направлением епископ Каменский и Алапаевский Мефодий.
        </p>
        <p>
          В организации Центра «Сумароково» приняли участие:
        </p>
        <ul>
          <li>
            лично Владыка Ферапонт, митрополит Костромской и Нерехтский;
          </li>
          <li>
            сотрудники Костромской епархии;
          </li>
          <li>
            сотрудники Управления Федеральной Службы России по Контролю за Оборотом Наркотиков по<br>
            Костромской области.
          </li>
          <li>
            Духовником центра назначен иерей Александр Абрадушкин.
          </li>
        </ul>
        <p>
          Здание, в котором разместился наш центр лечения наркомании, предоставлено Костромской епархией. Ранее оно принадлежало Свято-Троицкому монастырю.
        </p>
        <h3>
          Как мы работаем?
        </h3>
        <p>
          Эффективная работа центра проходит на основе взаимодействия православных священнослужителей, воцерковленных специалистов по работе с наркозависимыми и представителей государственных структур, таких как Департамент по труду и социальной защиты населения Костромской области ,  «Костромской областной наркологический диспансер», «Центр специализированной помощи по профилактике и борьбе с инфекционными заболеваниями», «Уголовно-исполнительная инспекция Управления Федеральной службы исполнения наказаний по Костромской области», «Управление по контролю за оборотом наркотиков УМВД России по Костромской области».
        </p>
        <p>
          Благодаря такому взаимодействию нам удается оказывать всестороннюю поддержку нуждающимся в лечении от наркомании и их семьям, достигать высоких результатов в деле лечения и профилактики наркозависимости.
        </p>
        <p>
          Основной принцип церковной реабилитации выражен в Положении «Об участии Русской Православной Церкви»:
        </p>
        <p class="quote">
          «Церковь, не отрицая подхода наркологии к реабилитации больных и используя методы,<br>
          выработанные профессиональным сообществом, в своей деятельности делает акцент на духовной<br>
          составляющей реабилитационного процесса».
        </p>
        <p>
          Более подробно с основами православной помощи наркозависимым можно ознакомиться <router-link class="animate" :to="'/program'">здесь</router-link>.
        </p>
      </div>
    </div>
  </div>
</template>

<style lang="scss">
  @import 'src/scss/_variables.scss';
  @import 'src/scss/_mixins.scss';

  .about {
    &-title {
      font-family: Garamond, serif;
      font-weight: bold;
      font-size: em(32);
      margin-left: 278px;
      text-align: center;
    }

    &-inside {
      font-size: em(19);
      margin-left: 278px;

      p {
        margin-top: 1em;

        &.quote {
          align-items: center;
          border-left: 10px solid $green;
          display: flex;
          margin-left: -20px;
          padding-left: 10px;
        }

        a {
          text-decoration: underline;

          &:hover {
            color: lighten($dark, 10%);
            text-decoration: none;
          }
        }
      }

      h3 {
        color: $accentColor;
        font-family: Calibri, sans-serif;
        font-weight: bold;
        margin-top: 1em;
      }

      ul {
        li {
          align-items: flex-start;
          display: flex;
          margin: 1em 0 0 -20px;

          &:before {
            background-color: $green;
            border-radius: 50%;
            content: '';
            display: block;
            flex-shrink: 0;
            height: 10px;
            margin-right: 10px;
            position: relative;
            top: 9px;
            width: 10px;
          }
        }
      }
    }
  }
</style>

<script>
  import vPhones from '@/js/components/common/phones.vue';

  export default {
    data() {
      return {
        title: 'О Фонде'
      }
    },
    created() {
      document.title = this.title;
    },
    components: {
      vPhones
    }
  }
</script>
